app/views/users/home.html.erb


    <% if current_user.skills.size > 0 %>
---
SELECT "skills".* FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = $1  [["user_id", 1]]